

#+NAME: Justin's Time Log
#+AUTHOR: Justin Southworth
#+DATE: Spring 2014
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00


* Pre week 1 (2-18)
** Learning how to make this org stuff work
  CLOCK: [2014-02-16 Sun 21:52]--[2014-02-17 Mon 01:12] =>  3:20
** Didn't clock correctly because of machine crashes. Which were due to having no space on my X-drive.
** DONE Reviewing org mode commands
   CLOSED: [2014-02-18 Tue 15:22]
   - CLOSING NOTE [2014-02-18 Tue 15:22] \\
     Probably will still need some work, but good enough for now.


* Week 1 take 2 (2/18 - 2/25)
:LOGBOOK:
  CLOCK: [2014-02-18 Tue 15:52]--[2014-02-18 Tue 15:53] =>  0:01
  * DONE Correcting and editing org file                   :class:tuesday:org:
CLOSED: [2014-02-19 Wed 12:19]
- State "DONE"       from "TODO"       [2014-02-19 Wed 12:19]
  CLOCK: [2014-02-18 Tue 14:38]--[2014-02-18 Tue 15:52] =>  1:14
  - Class
:PROPERTIES:
:ORDERED: t
:END:

** DONE Test TODO
CLOSED: [2014-02-19 Wed 12:01]
- State "DONE"       from "TODO"       [2014-02-19 Wed 12:01]

:PROPERTIES:
:ORDERED: t
:END:

- CLOSING NOTE [2014-02-18 Tue 15:50] \\
  take 3?

- CLOSING NOTE [2014-02-18 Tue 15:48] \\
  In progress??

   - CLOSING NOTE [2014-02-18 Tue 15:48] \\
     started wor
** DONE Fix org mode based on Nurk's email                 :wednesday:org:
CLOSED: [2014-02-19 Wed 15:11]
- State "DONE"       from "TODO"       [2014-02-19 Wed 15:11]
CLOCK: [2014-02-19 Wed 14:58]--[2014-02-19 Wed 15:11] =>  0:13

CLOCK: [2014-02-19 Wed 12:17]--[2014-02-19 Wed 12:18] =>  0:01
- Does a logbook exist?
CLOCK: [2014-02-19 Wed 12:04]--[2014-02-19 Wed 12:17] =>  0:13
- Updated emacs to get Nurk's package manager. This is a test to see if it worked.
CLOCK: [2014-02-19 Wed 12:03]--[2014-02-19 Wed 12:04] =>  0:01
- State "TODO"       from "IN_PROGRESS" [2014-02-19 Wed 12:01]


** DONE Class
CLOSED: [2014-02-24 Mon 15:06]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:06]
CLOCK: [2014-02-20 Thu 14:49]--[2014-02-20 Thu 15:51] =>  1:02
- Classtime.
CLOCK: [2014-02-20 Thu 14:42]--[2014-02-20 Thu 14:42] =>  0:00
:END:
** DONE Attempting to clean this file
CLOSED: [2014-02-19 Wed 15:25]
- State "DONE"       from ""           [2014-02-19 Wed 15:25]
CLOCK: [2014-02-19 Wed 15:12]--[2014-02-19 Wed 15:22] =>  0:10
- Can't fix the problem where the clocks and following messages are not indented well.
  That's just gonna be a mess to read. Did find how to further indent each line so
  that it looks a bit cleaner. Logbook still not showing up.

** DONE Back onto Logbook
CLOSED: [2014-02-24 Mon 15:11]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:11]
CLOCK: [2014-02-19 Wed 22:02]--[2014-02-19 Wed 22:02] =>  0:00
- Test.
CLOCK: [2014-02-19 Wed 21:47]--[2014-02-19 Wed 21:48] =>  0:01
:END:
CLOCK: [2014-02-19 Wed 17:53]--

CLOCK: [2014-02-19 Wed 16:24]--[2014-02-19 Wed 16:24] =>  0:00
- Nurk couldn't figure it out either, so I'm off of that for now.
CLOCK: [2014-02-19 Wed 15:51]--
CLOCK: [2014-02-19 Wed 15:24]--[2014-02-19 Wed 15:51] =>  0:27
:PROPERTIES:
:Effort:   0:30
:END:

** DONE Foo
CLOSED: [2014-02-19 Wed 18:02]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-19 Wed 18:02]
- State "IN_PROGRESS" from "DONE"       [2014-02-19 Wed 18:01] \\
  Stuff.
:END:
- State "DONE"       from "TODO"       [2014-02-19 Wed 17:28]
CLOCK: [2014-02-19 Wed 16:23]--[2014-02-19 Wed 16:23] =>  0:00
CLOCK: [2014-02-19 Wed 16:21]--[2014-02-19 Wed 16:23] =>  0:02
CLOCK: [2014-02-19 Wed 15:53]--

** DONE Prepping for the weekend
CLOCK: [2014-02-19 Wed 21:13]--[2014-02-19 Wed 21:19] =>  0:06
- On to checking if I can get the logbook to work.



** DONE Logbook on mac
CLOSED: [2014-02-24 Mon 15:14]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:14]
CLOCK: [2014-02-19 Wed 22:32]--[2014-02-19 Wed 22:42] =>  0:10
- Test...
CLOCK: [2014-02-19 Wed 22:03]--[2014-02-19 Wed 22:09] =>  0:06
- Broke
CLOCK: [2014-02-19 Wed 21:48]--[2014-02-19 Wed 22:01] =>  0:13
CLOCK: [2014-02-19 Wed 21:48]--[2014-02-19 Wed 21:48] =>  0:00
- Working..
:END:
CLOCK: [2014-02-19 Wed 21:40]--[2014-02-19 Wed 21:47] =>  0:07
- Maybe it worked this time???
CLOCK: [2014-02-19 Wed 21:20]--[2014-02-19 Wed 21:40] =>  0:20
- Switched computers.

** DONE Learning more emacs
CLOSED: [2014-02-24 Mon 15:14]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:14]
:END:
CLOCK: [2014-02-19 Wed 22:02]--[2014-02-19 Wed 22:03] =>  0:01
- Test failed... It's something in my .emacs file?
CLOCK: [2014-02-19 Wed 16:25]--[2014-02-19 Wed 17:28] =>  1:03
- Progress. Found some good pages of info.



** DONE New Test... The other broke?                                :test:
CLOSED: [2014-02-24 Mon 15:04]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-24 Mon 15:04]
- State "IN_PROGRESS" from "TODO"       [2014-02-24 Mon 15:03] \\
  Started.
CLOCK: [2014-02-19 Wed 22:26]--[2014-02-19 Wed 22:32] =>  0:06
- Test.
CLOCK: [2014-02-19 Wed 22:21]--[2014-02-19 Wed 22:26] =>  0:05
- More testing...
:END:

** DONE Test                                                        :test:
CLOSED: [2014-02-24 Mon 15:04]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:04]
CLOCK: [2014-02-19 Wed 22:17]--[2014-02-19 Wed 22:21] =>  0:04
- Broke the todo and can't seem to fix it..
CLOCK: [2014-02-19 Wed 22:16]--[2014-02-19 Wed 22:17] =>  0:01
- See?
:END:
CLOCK: [2014-02-19 Wed 22:09]--[2014-02-19 Wed 22:16] =>  0:07
- Commenting out the (require 'org) from my .emacs solved the problem...


** DONE Test 10000                                                  :test:
CLOSED: [2014-02-24 Mon 15:04]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:04]
:END:
CLOCK: [2014-02-19 Wed 22:42]--[2014-02-20 Thu 00:22] =>  1:40
- Clocking in and out started failng.



** DONE Dictionary list page
CLOSED: [2014-02-27 Thu 15:05]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-27 Thu 15:05]
CLOCK: [2014-02-24 Mon 16:45]--[2014-02-24 Mon 18:03] =>  1:18
- Got the page working. Need some seeds in the db now.
- State "TODO"       from "IN_PROGRESS" [2014-02-24 Mon 15:15]
CLOCK: [2014-02-24 Mon 14:56]--[2014-02-24 Mon 16:37] =>  1:41
:PROPERTIES:
:Effort:   2:00
:END:
- Caught bad error again where the vb freezes up. Waited a while and it came back though.
:END:

** DONE Survey CRUD page
CLOSED: [2014-02-27 Thu 15:05]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-27 Thu 15:05]
CLOCK: [2014-02-24 Mon 21:12]--[2014-02-24 Mon 23:04] =>  1:52
- Got everything started up. These messages feel like they're the same as my commit messages...
:END:

** DONE Enabling ssh into vb
CLOSED: [2014-02-24 Mon 16:45]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 16:45]
CLOCK: [2014-02-24 Mon 16:37]--[2014-02-24 Mon 16:45] =>  0:08
:END:



* Week 2
** DONE Code Review                                                :class:
CLOSED: [2014-02-27 Thu 15:02]
:LOGBOOK:
- CLOSING NOTE [2014-02-27 Thu 15:02] \\
  Went well.
CLOCK: [2014-02-25 Tue 13:58]--[2014-02-25 Tue 15:48] =>  1:50
- Everyone fails. False.
:END:
** DONE Thursday                                                      :class:
CLOSED: [2014-02-27 Thu 15:04]
:LOGBOOK:
CLOCK: [2014-02-27 Thu 13:58]--[2014-02-27 Thu 15:03] =>  1:05
- Talked about nginx and other servers.
:END:

** DONE Learning about Django tests                         :class:django:
CLOSED: [2014-03-12 Wed 22:30]
:LOGBOOK:
CLOCK: [2014-03-02 Sun 15:49]--[2014-03-02 Sun 16:51] =>  1:02
- Switching over..
- State "IN_PROGRESS" from "TODO"       [2014-02-27 Thu 15:54] \\
  Doin stuff..
CLOCK: [2014-02-27 Thu 15:03]--[2014-02-27 Thu 15:53] =>  0:50
- Started learning about Django testing.
:END:
** DONE Learning the template system                              :django:
CLOSED: [2014-03-12 Wed 22:30]
:LOGBOOK:
- CLOSING NOTE [2014-03-12 Wed 22:30]
CLOCK: [2014-03-02 Sun 19:48]--[2014-03-02 Sun 21:28] =>  1:40
- Read a lot of stuff. Commented in a few things for later.
CLOCK: [2014-03-02 Sun 16:51]--[2014-03-02 Sun 18:16] =>  1:25
- Read through Django's documentation.
:END:

* Week 3
** DONE Tuesday                                                    :class:
CLOSED: [2014-03-11 Tue 13:59]
:LOGBOOK:
- CLOSING NOTE [2014-03-11 Tue 13:59] \\
  Class be over.
CLOCK: [2014-03-04 Tue 14:03]--[2014-03-04 Tue 16:00] =>  1:57
- Got lots of stuff done. Meeting in here at 9 tonight if free.
:END:
** DONE Thursday                                                   :class:
CLOSED: [2014-03-11 Tue 14:00]
:LOGBOOK:
CLOCK: [2014-03-06 Thu 13:50]--[2014-03-06 Thu 15:56] =>  2:06
- Git craziness. Done with first iteration.
:END:
** IN_PROGRESS Combine/unify my 4 init.el files so stuff makes sense again... :emacs:org:
:LOGBOOK:
CLOCK: [2014-03-08 Sat 18:02]--[2014-03-08 Sat 23:10] =>  5:08
:END:
:PROPERTIES:
:Effort:   4:00
:END:
** DONE Read In the Beginning...
CLOSED: [2014-03-11 Tue 14:00]
:LOGBOOK:
- CLOSING NOTE [2014-03-11 Tue 14:00]
CLOCK: [2014-03-10 Mon 14:56]--[2014-03-10 Mon 17:45] =>  2:49
- Good stuff.
:END:
* Week 4
** DONE Tuesday                                                    :class:
CLOSED: [2014-03-12 Wed 22:30]
:LOGBOOK:
- CLOSING NOTE [2014-03-12 Wed 22:30]
CLOCK: [2014-03-11 Tue 13:59]--[2014-03-11 Tue 15:48] =>  1:49
- Ryan ___ from Aon.
:END:
** DONE Organizing
CLOSED: [2014-03-12 Wed 23:25]
:LOGBOOK:
CLOCK: [2014-03-12 Wed 22:30]--[2014-03-12 Wed 22:46] =>  0:16
- Just figuring out where things are at.
:END:
** DONE Mas emacsing                                                  :emacs:
CLOSED: [2014-03-12 Wed 23:25]
:LOGBOOK:
CLOCK: [2014-03-12 Wed 22:46]--[2014-03-12 Wed 23:25] =>  0:39
- Added auto indenting and some other stuff.
:END:
** IN_PROGRESS Writing dictionary tests
:LOGBOOK:
CLOCK: [2014-03-13 Thu 10:05]--[2014-03-13 Thu 11:14] =>  1:09
- Solved the dictionary delete test, and fixed indentation errors I made.
CLOCK: [2014-03-12 Wed 23:22]--[2014-03-13 Thu 00:17] =>  0:55
- Getting somewhere. Stopped at delete for bed.
:END:
** TODO Ask what the red light switch does
** IN_PROGRESS Thursday                                            :class:
:LOGBOOK:
CLOCK: [2014-03-13 Thu 13:54]--[2014-03-13 Thu 15:59] =>  2:05
- Did stuff with south. Figured out what to do next
:END:
** TODO Tests and standardization
